use std::{
    sync::{atomic::AtomicU64, Arc},
    time::Instant,
};

////////////////////////////////////////////////////////////////////////////////

/// Итем в очереди
pub(super) struct DelayItem<T> {
    /// В какой момент времени надо отдать будет итем
    pub(super) pop_time: Instant,

    /// Сам итем непосредственно
    pub(super) item: T,

    /// Какая именно футура зарезервировала этот итем.
    /// Используется именно Arc, так как итемы у нас под блокировкой
    pub(super) reserved: Arc<AtomicU64>,
}
